{"biden": ["U.S. President Joe Biden sought to calm global financial market jitters on the looming debt limit weeks before the nation is at risk of defaulting on its financial obligations for the first time in history.\n\nBiden met Tuesday afternoon with Republican House Speaker Kevin McCarthy and Senate Minority Leader Mitch McConnell, as well as Democratic House leader Hakeem Jeffries and Senate Majority Leader Chuck Schumer, in a bid to ensure the government can borrow more money to pay for spending it has already incurred.\n\n'We're going to get started and solve all the world's problems,' Biden said as the Oval Office meeting began. He and the other leaders declined to take reporters' questions ahead of the meeting.\n\nWithout a deal between the White House and congressional leaders, the country is estimated to be weeks from default. Earlier, the White House warned that the United States defaulting on its debts would be 'a gift' to adversaries, including China and Russia, and would lead to a recession that could send shock waves across the global economy.\n\n'We cannot be a deadbeat nation,' White House press secretary Karine Jean-Pierre said during her press briefing on Tuesday, warning congressional Republicans who are refusing to raise the nation's debt limit unless it's paired with spending cuts.\n\n'Default would create global uncertainty about the value of the U.S. dollar and U.S. institutions and leadership, leading to volatility in currency and financial markets and commodity markets that are priced in dollars,' Jean-Pierre said.\n\nDirector of National Intelligence Avril Haines previously made a similar point to the Senate Intelligence Committee about the national security consequences of the U.S. teetering on the edge of a fiscal cliff.\n\nBut Republicans are urging spending cuts and blame Biden for the impasse.\n\n'The solution is clear. It's been clear for months,' McConnell said ahead of the meeting. 'President Biden needs to negotiate on spending with Speaker McCarthy. The Speaker's been at the table since February. House Republicans are the only people in town who have passed any bill that prevents default.'\n\nThe Treasury debt limit, which caps the amount of outstanding debt the country can have and thus Treasury's ability to issue securities to fund the government's obligations, was reached on January 19.\n\nEven with Treasury taking 'extraordinary measures' to pay the government's bills, Treasury Secretary Janet Yellen told lawmakers last week that the department's ability to pay the government's bills could run short as early as June 1 - what's commonly known as the X-date.\n\nRepublicans are insisting that the federal government reduce spending before they will agree to raise the debt ceiling. Meanwhile, Biden is adamant that Congress has a duty to pay its bills and that the two issues should be addressed separately.\n\nCeiling raised many times before\n\nLifting the debt ceiling was once a routine vote. Congress has raised it 78 times since 1960, 29 times under Democratic presidents and 49 times under Republican presidents, including three times under former President Donald Trump.\n\nHow would a U.S. default affect the world?\n\nThe U.S. economy is the largest in the world, and the U.S. dollar is considered the world's reserve currency, meaning that many countries' central banks and other monetary authorities hold U.S. dollars as part of their foreign exchange reserves as a backup in case their own currency fails.\n\nA debt event in the United States would have serious consequences not only for the U.S. but also for the global economy and for world financial markets.\n\nShould the U.S. fail to pay its debts, in addition to creating havoc in global stock markets and sending the American economy into recession, it would trigger a sell-off in U.S. Treasury bonds, weakening the dollar and raising interest rates. This would affect foreign currency reserves held by other countries and make the costs of borrowing more expensive, potentially leading countries with already high levels of borrowing into a debt crisis.\n\n'If interest rates in the United States go up, it's going to take all other interest rates up with it. It's going to make all other risk assets look very shaky,' said Desmond Lachman, former deputy director at the International Monetary Fund and now a fellow at the American Enterprise Institute.\n\nLachman agreed with Yellen that a U.S. debt default would be an economic catastrophe that must be avoided.\n\nLachman told VOA the world can ill-afford such financial turbulence, especially with the regional banking crisis that began with the collapse of Silicon Valley Bank in March, followed by the toppling of two other U.S. banks - Signature Bank and First Republic.\n\nSafest investment\n\nU.S. Treasury bonds are traditionally considered the safest investment that global financial investors turn to in times of distress, said Heidi Crebo-Rediker, former chief economist of the U.S. Department of State and adjunct senior fellow at the Council on Foreign Relations.\n\n'It is the deepest, most liquid, solid and reliable market in the world,' she said.\n\nCrebo-Rediker added that countries and investors need not be overly concerned about an actual U.S. default.\n\n'This is a question of willingness to pay, not ability to pay,' she said. 'And that is a very big distinction.'", "GBPUSD has fluctuated between gains and losses so far this week, keeping in line with the rangebound nature of markets so far. The Asian session has seen modest gains for cable as a renewed bout of Dollar weakness reared its head ahead of the US CPI data release.\n\nThe Dollar itself has hovered near multi-month lows with the US debt ceiling impasse providing the Dollar with short-term support. Yesterday's talks between US President Joe Biden and Republican Leader Mitch McConnel reached a stalemate. The ongoing indecision around the debt ceiling continues to weigh on sentiment which has helped the US Dollars haven appeal. Any knee jerk reaction by markets could see a selloff in equities and haven demand rise which could continue to support the US Dollar with Gold and the Japanese Yen likely to rise as well.\n\nThe US will release its April inflation data today with consensus for a 0.4% rise MoM with the YoY print forecast at 5%. The core inflation rate is expected to tick lower by 0.1% to 5.5%. There is some fear heading into the US CPI release as last week's jobs data showed an uptick in average hourly earnings. An uptick in inflation could see market participants reprice the probability of rate cuts in the second half of 2023 and provide the dollar with support. Following last week's FOMC meeting markets were pricing a rate cut as early as July, but that has since changed with markets now seeing rate cuts appearing in September at the earliest.\n\nFor all market-moving economic releases and events, see the DailyFX Calendar\n\nTomorrow, we have the Bank of England (BoE) rate decision which should provide some volatility to GBP pairs. The Central Bank is expected to deliver a 25bps hike tomorrow as the inflation print remains strong. The majority of this however appears to be priced in with the forward guidance and comments from BoE policymakers likely to hold more sway.\n\nOn the daily timeframe GBPUSD daily candle from yesterday provides an indication of the indecision prevalent at markets at present. A doji candle close on the daily timeframe as cable fluctuated between gains and losses closing the day above the 1.2600 handle.\n\nGBPUSD remains bullish however the RSI is in overbought territory as well. The intraday trend remains bullish as well following a modest rally overnight with rangebound opportunities aplenty ahead of the CPI release. A break above the recent high at 1.2660 could open up a sharp run toward the 1.3000 handle as we have a lack of resistance between the 1.2660 and 1.3000 handles respectively.\n\nI would like to see a deeper correction before the upside rally continues with a test of the 1.2500 level likely providing a better risk-to-reward opportunity for would be longs. A daily candle close below the 1.2470 handle would invalidate the bullish structure.", "Kiew - Die Ukraine verfügt nach Auffassung der US-Regierung über alle notwendigen Mittel, um bei einer Gegenoffensive von Russland besetzte Gebiete zurückzuerobern.\n\n\"Sie haben alles, was sie brauchen, um bei der Rückeroberung von Gebieten, die Russland in den letzten 14 Monaten mit Gewalt erobert hat, erfolgreich zu sein\", sagte US-Außenminister Antony Blinken bei einer Pressekonferenz mit seinem britischen Amtskollegen James Cleverly am Dienstag in Washington. Zuvor hatte die US-Regierung weitere militärische Unterstützung für die Ukraine im Wert von 1,2 Milliarden US-Dollar (rund 1,1 Milliarden Euro) angekündigt. Der ukrainische Präsident Wolodymyr Selenskyj begrüßte das neue Hilfspaket ausdrücklich.\n\n\"Ich danke Präsident (Joe) Biden, dem Kongress - beiden Parteien - und jeder amerikanischen Familie für ihre kontinuierliche Unterstützung und für die amerikanische Stärke, die uns stärker macht\", sagte Selenskyj gestern in seiner allabendlichen Videoansprache. Mit der neuen US-Hilfe soll insbesondere die ukrainische Luftverteidigung gestärkt und der Bedarf an Munition gesättigt werden, wie das US-Außenministerium mitteilte. Die USA schicken demnach auch zusätzliche Artilleriegeschosse und Unterstützung für die Instandhaltung vorhandener Waffensysteme.\n\nDie USA gelten als wichtigster Verbündeter der Ukraine im Abwehrkampf gegen die russische Invasion. Laut Verteidigungsministerium steuerten die Vereinigten Staaten seit Kriegsbeginn Militärhilfe im Wert von mehr als 36,9 Milliarden US-Dollar bei.\n\nNach Einschätzung von Generalinspekteur Carsten Breuer kommt die Ukraine mit Vorbereitungen für eine Gegenoffensive voran. \"Mir wurde erläutert, wie der Kampf an vorderster Linie geführt wird. Der Boden ist immer noch morastig und feucht. Teilweise stehen noch große Seen auf den Feldern. Die Voraussetzungen für eine umfassende Offensive waren in den letzten Wochen noch nicht gegeben\", sagte Breuer der Deutschen Presse-Agentur. \"Mir ist in allen Gesprächen aber deutlich geworden, dass Planungen für die ukrainische Offensive laufen.\" Der ranghöchste deutsche Soldat war in der vergangenen Woche in der Ukraine gewesen und hatte dort Armeechef Walerij Saluschnyj und Verteidigungsminister Olexij Resnikow getroffen.\n\nDer ukrainische Außenminister Dmytro Kuleba warnt indes vor zu hohen Erwartungen an die erwartete Frühjahrsoffensive. \"Betrachten Sie diese Gegenoffensive nicht als die letzte, denn wir wissen nicht, was dabei herauskommen wird\", sagte er der \"Bild\"-Zeitung. Nur wenn es gelinge, bei dieser Offensive die russisch besetzten Gebiete zu befreien, werde es die Letzte sein. \"Aber wenn nicht, dann bedeutet das, dass wir uns auf die nächste Gegenoffensive vorbereiten müssen.\"\n\nDas US-Verteidigungsministerium bestätigte unterdessen den ukrainischen Abschuss einer russischen Hyperschallrakete mit dem Patriot-System. Die Ukrainer hätten mithilfe des US-Flugabwehrsystems die Rakete abgefangen, sagte Pentagon-Sprecher Pat Ryder in Washington. Ryder bestätigte auch die Information der Ukrainer, dass es sich um eine Rakete des Typs Kinschal gehandelt habe. Der russische Präsident Wladimir Putin hatte diese als \"unverwundbar\" gegen westliche Abwehrsysteme gelobt.\n\nAm Samstag hatte die ukrainische Luftwaffe den erfolgreichen Abschuss einer solchen Hyperschallrakete verkündet. Die von Moskau als eine der besten Raketen überhaupt angepriesene Kinschal (Russisch: \"Dolch\") war den Angaben zufolge mithilfe des US-Abwehrsystems Patriot über der Region Kiew abgefangen worden. Die extrem schnell und hoch fliegenden und dennoch manövrierfähigen Raketen setzen russischen Streitkräfte mindestens seit März im Krieg in der Ukraine ein, etwa zur Zerstörung von Treibstoff- und Waffenlagern.\n\nDas Europaparlament wird einen Plan für deutlich mehr Munitionslieferungen an die Ukraine in einem Dringlichkeitsverfahren behandeln. So sollen bereits im Juni Verhandlungen zu den Details des Vorhabens mit den EU-Staaten aufgenommen werden können, wie das Parlament am Dienstag mitteilte.\n\nDie EU-Kommission hatte vergangene Woche Vorschläge präsentiert, wonach die europäische Rüstungsindustrie mit finanziellen Anreizen in Milliardenhöhe zu einem schnellen Ausbau der Produktionskapazitäten bewegt werden soll. Hintergrund sind insbesondere Schwierigkeiten der EU-Staaten, der Ukraine ausreichend Munition für den Abwehrkrieg gegen Russland zu liefern.\n\nUkrainische Verteidiger und russische Angreifer haben sich gestern erneut schwere Kämpfe im Osten der Ukraine geliefert. Im Mittelpunkt des Geschehens stand einmal mehr die seit Monaten schwer umkämpften Stadt Bachmut, wie der ukrainische Generalstab in seinem abendlichen Lagebericht mitteilte. Neben Bachmut stießen russische Truppen auch bei Liman, Awdijiwka und Marjinka vor. Insgesamt seien dort in den vergangenen Stunden rund 30 Angriffe abgeschlagen worden.\n\nWie die französische Nachrichtenagentur AFP am Dienstag mitteilte, wurde ihr Videojournalist Arman Soldin am Nachmittag bei einem Raketenangriff in der Nähe von Bachmut getötet. Frankreichs Präsident Emmanuel Macron schrieb auf Twitter, man teile den Schmerz der Verwandten und Kollegen Soldins. \"Seit den ersten Stunden des Konflikts war er an der Front, um Tatsachen zu ermitteln. Um uns zu informieren.\" Laut Reporter ohne Grenzen kamen im vergangenen Jahr sechs Journalisten in der Ukraine ums Leben, in diesem Jahr starb dort vor Soldin bereits ein anderer Reporter im Einsatz.\n\nEU-Kommissionspräsidentin Ursula von der Leyen hat ein positives Fazit ihrer jüngsten Reise in die ukrainische Hauptstadt Kiew gezogen. Man habe ausführlich über die Fortschritte und die noch ausstehenden Arbeiten für die Aufnahme von EU-Beitrittsverhandlungen gesprochen, sagte sie auf der Rückreise. Sie sei nach diesem Besuch mehr denn je beeindruckt von der Entschlossenheit der Ukrainer.\n\nVon der Leyen hatte bei ihrem Besuch in Kiew unter anderem Präsident Selenskyj und Ministerpräsident Denys Schmyhal getroffen. Ihren Angaben zufolge wird die EU-Kommission bereits im Juni mündlich eine erste Bewertung der aktuellen Reformanstrengungen der Ukraine an den Rat der Mitgliedstaaten übermitteln. Im Oktober soll es dann einen schriftlichen Bericht geben, auf Grundlage dessen eine Entscheidung über den Start von Beitrittsverhandlungen getroffen werden soll. Die Ukraine ist seit vergangenem Sommer offiziell EU-Beitrittskandidat.\n\nIm Osten der Ukraine werden weiter schwere Kämpfe vor allem um die Stadt Bachmut erwartet.", "WASHINGTON (AP) -- Facing growing pressure to show progress in their investigations, House Republicans on Wednesday plan to detail what they say are concerning new findings about President Joe Biden 's family and their finances.\n\nThe smoking gun, according to the GOP, is \"thousands of pages\" of recently obtained financial records that include more than 150 suspicious activity reports connected to the president's son Hunter Biden and brother James Biden, as well as a growing number of associates.\n\nThe confidential reports, called SARs for short, are often routine, with larger financial transactions automatically flagged to the government. The filing of a SARs report is not evidence on its own of misconduct.\n\nBut Republicans in Congress, notably Rep. James Comer, the chairman of the House Oversight Committee leading the probe, believe the records could potentially show an effort by the president and his family to trade off his name.\n\nThe White House has continuously dismissed the investigation as \"yet another political stunt.\"\n\n\"Congressman Comer has a history of playing fast and loose with the facts and spreading baseless innuendo while refusing to conduct his so-called 'investigations' with legitimacy,\" White House spokesperson Ian Sams said in a statement.\n\nHere's a deeper look at suspicious activity reports and how Republicans are using them as a roadmap to investigate the Biden family:\n\nFinancial institutions are required to file a suspicious activity report to the Financial Crimes Enforcement Network (FinCEN) no later than 30 calendar days from when it detects a suspicious transaction that could have links to money laundering or terrorism financing.\n\nFirst originated as a \"criminal referral form,\" suspicious activity reports were established through the 1970 Bank Secrecy Act. In 1996, according to FinCEN, the form became the standard way to report suspicious activity in the financial system.\n\nThe rules around the reports were later amended under the U.S. Patriot Act. Today, banks and credit unions routinely submit SARs.\n\nIndustries that deal in large sums of money are required to file SARs to the government when they detect a transaction with possible links to money laundering, counterfeiting, fraud or illicit finance -- this includes banks, casinos, loan companies and depository firms.\n\nSigns of insider trading and individual transactions of $5,000 or more often trigger an institution to file a report, but the Federal Deposit Insurance Corporation states that entities \"are encouraged to file nonetheless in appropriate situations involving these matters, based on the potential harm that such crimes can produce.\"\n\nLarge transactions involving foreign payers -- like the kind that Hunter and James Biden are known to have engaged in through their work -- are the kinds of transactions often flagged to federal authorities.\n\nSARs can also be filed by individuals or entities outside the financial sector, including law enforcement, public safety workers, city or state officials, business owners, and even the general public.\n\nLaw enforcement agencies use the reports to uncover and prosecute illegal activity, as well as help identify and counteract fraudulent and criminal behavior before it becomes a larger issue.\n\nIn recent years, electronic SARs reporting has increased through FinCEN's Bank Secrecy Act e-filing system. Nearly 42,000 reports were filed by the loan and financial services industry in 2021, according to data compiled by FinCEN, a huge jump from the more than 1,500 reports filed in 2015.\n\nThe filing of suspicious activity reports against elected officials is not uncommon. During the Trump administration, Deutsche Bank's anti-money laundering division recommended filing suspicious activity reports on transactions conducted by Trump companies, including the Trump Foundation, and firms owned by his son-law Jared Kushner.\n\nMichael Cohen, a one-time attorney for former President Donald Trump, had several suspicious activity reports filed against him, including one that recorded a $500,000 deposit from a company connected to a Russian oligarch who donated money to Trump's inauguration fund.\n\nMost SARs are never made public. The records connected to Trump and Cohen were revealed through leaks to the media and as part of federal investigations.\n\nSuspicious activity reports are cloaked in secrecy to make them useful for law enforcement. The person suspected of triggering a SARs is not routinely informed about the pending report.\n\nAny discussion or disclosure about SARs to outside groups such as news outlets would be considered an unauthorized disclosure and is punishable as a federal criminal offense.\n\nIn the case involving Cohen, Trump's former personal lawyer, an IRS employee was charged by federal prosecutors in 2019 with leaking banking records that had been flagged as suspicious activity.\n\nThe confidentiality rules have come up again as Comer conducts his probe into supposed suspicious activity reports by Biden family members. The Kentucky lawmaker and some committee members and staff were recently able to view some of the thousands of pages of the Biden family's financial records through subpoenas made to the Treasury Department and various financial institutions since January.\n\nA handful of lawmakers immediately began talking on social media and cable news about what they had seen in the reports, asserting evidence of misconduct.\n\nHouse Democrats have accused Comer and other Republicans on the committee of potentially violating the Bank Secrecy Act.\n\nRepublicans vowed after winning the House majority last year that they would use their subpoena power to investigate foreign entities that did business with the family during Biden's time as vice president and during the Trump administration, including a specific focus on his son Hunter.\n\nThe younger Biden's taxes and foreign business work are already under federal investigation, with a grand jury in Delaware reportedly making a charging decision in the next few months. And while Hunter Biden never held a position on the presidential campaign or in the White House, his membership on the board of a Ukrainian energy company and his efforts to strike deals in China have long raised questions about whether he traded on his father's public service, including reported references in his emails to the \"big guy.\"\n\nJoe Biden has said he's never spoken to his son about his foreign business. And there are no indications that the federal investigation involves the president in any way.\n\nUp until now, Comer and Republicans have not publicly revealed evidence to substantiate their claims of wrongdoing by the Biden family. But Comer said their investigation into the Biden family is widening.\n\n\"This is not just about the president's son. This is about the entire Biden family, including the president of the United States,\" Comer said during an appearance Sunday on Fox News. \"So we believe there are a whole lot of accounts that the IRS and the DOJ don't know about because we don't believe they have done a whole lot of digging in this. And we have.\""], "tesla": ["Twitter is getting a bunch of improvements for its messaging feature, including a new emoji picker and individual reply capability. Nonetheless, the most significant improvement might be the encrypted messages Twitter owner Elon Musk promised to release this week.\n\nTwitter has a lot of work to do to make its platform enticing to everyone again and regain some of the users it lost. With this, the company frequently tries to introduce enhancements to the platform. This week, the company focuses on improving the Twitter messaging system, which should now have new features in its new app version.\n\nAccording to the Twitter Support team's recent announcement, users will now see a wider selection of emojis via the new picker in the DM. To recall, the original version of Twitter DM had a very minimal set of emoji, making the reaction experience kind of limiting. This is now changed, and our team can confirm this in the recent mobile app installation.\n\nAlso, users should now be able to reply individually to specific messages within the DMs in this new update. According to the company, this should make the conversation \"smoother and more intuitive.\"\n\nTwitter is not the first to introduce the features. They have been in other messaging systems of other apps (e.g., Facebook Messenger) for some time now, but it is nice to see Twitter adopting them as well. The company also shared plans to walk the extra mile to make its messaging system stand out in the future by bringing more features. As such, Twitter promised to bring web support for the features mentioned above and deliver \"better rendering for replies to media messages.\" According to Musk, users would also be able to perform voice and video chat using Twitter handles, which should allow you to \"talk to people anywhere in the world without giving them your phone number.\"\n\nAside from those features mentioned above, the main highlight of this week's announcement from the blue bird company is the arrival of encrypted DMs. As per Musk, the \"release of encrypted DMs V1.0 should happen tomorrow,\" and noted that \"the acid test is that I could not see your DMs even if there was a gun to my head.\" The Tesla CEO promised to quickly improve this feature, but it is hard to believe it is actually rolling out now without proof. And given Twitter's present credentials in fulfilling its promises, it is better to take things with a grain of salt. Yet, in case it really arrives, it could help Twitter restore its image, which is now being eroded by a series of recent privacy issues.", "LONDON - Chinese-made electric vehicles (EVs) pose the greatest risk to Europe's carmakers and could cost them 7 billion euros ($7.7 billion) a year in lost profits by 2030 unless policymakers take action, according to an Allianz Trade report.\n\nAccording to the report released on Tuesday by the unit of German insurer Allianz, policymakers need to meet the challenge with reciprocal tariffs on imported cars from China, do more to develop EV battery materials and technologies, and also allow Chinese carmakers to build cars in Europe.\n\nEurope's carmakers face a dual threat from the prospect of falling sales of their own vehicles in China, where local EV makers have been growing market share, and from rising sales of imported Chinese EVs - made by Chinese or Western carmakers.\n\nGlobal carmakers have pledged to make a comeback in China with a large number of EVs in a fast-moving market where the pressure to cut prices is getting more intense.\n\nA crowded market for all-electric SUVs in China is putting pressure on local carmakers to export more vehicles to Europe.\n\nChinese EV imports could cost the European Union over 24 billion euros in economic output in 2030, or 0.15% of the bloc's gross domestic product, Allianz Trade said.\n\nBut the \"automotive-dependent economies of Germany, Slovakia and Czech Republic could face an even bigger hit\" of between 0.3% to 0.4% of GDP, said the report, titled: \"The Chinese challenge to the European automotive industry\".\n\n\"The stakes are high for Europe's automotive industry: four out of five cars sold in Europe are assembled locally,\" the report added.\n\n\"Europe is also the world's export powerhouse in the sector, with car trade generating between 70 billion and 110 billion euros in trade surplus for the European economy every year over the past decade.\"\n\nThe report said the U.S. Inflation Reduction Act (IRA) had made Europe a target for Chinese exports.\n\nWhile Europe remains comparatively open to imported EVs - Tesla, for instance, accounts for 20% of fully-electric car sales in Europe - the United States is \"set to be a much tougher market to crack for Chinese vehicles\" because of the IRA, the report said.\n\n($1 = 0.9071 euros)", "Although artificial intelligence (AI) is Wall Street's favored next-big-thing investment, not all AI stocks are going to be winners.\n\nInvesting on Wall Street has been a challenge since the start of 2022. Last year, all three major U.S. stock indexes tumbled into a bear market, with growth stocks getting hit particularly hard. The innovation-driven Nasdaq Composite ended the year lower by 33%.\n\nBut when dark clouds are hovering over Wall Street, investors have a way of finding even the slightest glimmer of hope. In 2023, investors have turned their attention to the next-big-thing investment, artificial intelligence (AI).\n\nAI involves using software and systems to handle tasks normally overseen by humans. What makes AI so intriguing is the machine-learning (ML) aspect. Specifically, ML allows software and systems to learn and evolve over time, just as a human would, in order to become more efficient at a task. Best of all, AI has broad application across all sectors of the market.\n\nInvestors would probably struggle to find a growth opportunity bigger than AI this decade. According to a report from Grand View Research, worldwide AI sales are expected to catapult from nearly $197 billion to $1.81 trillion by 2030. That's a compound annual growth rate of a cool 37.3%.\n\nBut as we've learned from next-big-thing investments over the past 30 years, not every company is necessarily going to be a winner. Investor expectations with next-big-thing investments almost always outpace the ramp of adoption. In simpler terms, next-big-thing investments can be phenomenal long-term wealth creators, but they have a tendency to be initially overhyped.\n\nFurthermore, the Federal Reserve is modeling a \"mild recession\" into its outlook for later this year. When U.S. economic growth weakens, investors have less tolerance for premium valuations and companies that fail to deliver. This is especially true for businesses involved in next-big-thing investments.\n\nDespite AI being the hottest thing since sliced bread, there are three ultra-popular artificial intelligence stocks I wouldn't buy with free money.\n\nThe first widely held AI stock I wouldn't touch with a 10-foot pole is graphics processing unit (GPU) and networking solutions provider Nvidia (NVDA -1.99%).\n\nNvidia is best-known for its GPUs, which are popular among hardcore personal-computing gamers. However, it's Nvidia's data center GPUs that are gaining the company notoriety. Nvidia's AI-inspired A100 GPUs for data centers are effectively the foundation that allows AI-based software and systems to make split-second decisions. Back in March, CEO Jensen Huang noted in an interview with Yahoo Finance that his company has seen an uptick in demand for the company's generative AI solutions.\n\nAlthough Nvidia is profitable and its stock is absolutely on fire in 2023, it's not a stock I'd want to put any money to work in at the moment for three reasons.\n\nTo begin with, Nvidia's products are cyclical. This means demand for its products tends to ebb and flow with the U.S. and global economy. With the nation's central bank and a laundry list of economic indicators signaling a recession is likely at some point in the future, cyclical tech stocks near a 52-week high isn't where I want my money.\n\nSecondly, Nvidia's most-profitable operating segment has been a dud over the previous three fiscal quarters. While gaming revenue popped during the pandemic, a return to some semblance of normal has sent gaming revenue down by as much as 51% on a year-over-year basis. This slump in gaming GPU sales is weighing on sales and profits.\n\nThe third factor is valuation. Nvidia's growth engine completely stalled in fiscal 2023 (Nvidia's fiscal year ends in late January), with sales expected to grow by just 11.5% in fiscal 2024, assuming demand keeps up with inventory. However, investors are paying 63 times forecast earnings for an 11.5% sales growth rate that I believe is at risk of being reduced. Despite being the face of AI innovation, Nvidia stock simply isn't worth the risk at its lofty valuation.\n\nA second artificial intelligence stock I wouldn't touch with free money is cloud-based data warehousing company Snowflake (SNOW 2.15%).\n\nSnowflake has been all the rage among cloud-computing investors since its initial public offering in September 2020. That's because it brings well-defined competitive advantages to the table in a space that's still considered to be in the very early innings of its growth ramp. As an example, Snowflake's infrastructure is built atop the most-popular cloud-service infrastructure platforms, which allows its members to seamlessly share data across competing platforms.\n\nWhere Snowflake gets its AI chops is through the incorporation of machine-learning tools in its data cloud. As my Foolish colleague Anders Bylund laid out last month, Snowflake has forged partnerships and made acquisitions to further its AI ambitions and support the rapid processing speeds needed for AI solutions to run optimally.\n\nUnfortunately, Snowflake shares many of the headwinds that Nvidia is contending with. Namely, it's a cyclical tech stock that's already begun to see order demand slow.\n\nWhen the company reported its fiscal third-quarter results at the end of November, management called for 47% full-year sales growth in fiscal 2024, which was, at the time, a tad shy of Wall Street's expectations. Following its fourth-quarter results, which were released in early March, full-year sales growth projections had dropped to 40% for fiscal 2024 (Snowflake's fiscal year ends Jan. 31). Though 40% growth would still be pretty stellar, Snowflake commands a nosebleed valuation because of its superior growth prospects. If sales forecasts are falling, the company's lofty valuation will likely follow.\n\nThe other important factor to consider with Snowflake is that it's not even close to profitability on the basis of generally accepted accounting principles (GAAP). Despite a 65% gross margin and a gross profit that increased 77% in fiscal 2023, the company's operating loss swelled by $127.2 million to $842.3 million. There's no reason to pay over 17 times sales for a company whose operating performance is worsening on a GAAP basis as we potentially head into a recession.\n\nThe third ultra-popular artificial intelligence stock I wouldn't buy with free money is none other than electric-vehicle (EV) manufacturer Tesla (TSLA -1.54%).\n\nTesla's rise to becoming one of the largest publicly traded companies in the world was built on first-mover advantages in the EV space. It's the first automaker in more than a half-century to build itself from the ground up to mass production. After producing 1.37 million EVs in 2022, the ramp-up in production activity at the Austin and Berlin gigafactories should lift the company's output to 1.8 million EVs this year.\n\nAnother key to Tesla's success has been its incorporation of AI. Specifically, AI is the foundation of Tesla's Level 2 full self-driving (FSD) software. Tesla's FSD uses sensors and machine vision cameras to safely navigate its EVs around surrounding traffic and pedestrians. Although not fully autonomous, the company's Level 2 FSD allows for partial automation with the driver able to assist if needed.\n\nAlthough we've witnessed a big advancement in the technology used in vehicles in recent years, Tesla is a stock I'd avoid for three reasons.\n\nThe first mirrors what I said earlier about Nvidia and Snowflake: auto stocks are cyclical. Vehicle-buying demand tends to move in lockstep with the U.S. economy, which doesn't bode well for Tesla over the near-term. Whereas auto stocks typically trade at mid-to-high-single-digit earnings multiples, Tesla is commanding a price-to-earnings ratio of almost 50. That's far too much for a company that's, thus far, failed to become more than a just a car company.\n\nAnother warning for current and prospective shareholders is the company's pricing action in 2023. Putting aside the token price hike of $250 Tesla implemented on its EVs last week, the company had enacted six price reductions since the year began. Even with these price cuts, inventory levels have been soaring. Chances are good that Tesla's automotive gross margin is going to sink further in the coming quarters.\n\nLastly, I wouldn't touch Tesla stock with a 10-foot pole because I don't trust CEO Elon Musk. While I recognize that he's a visionary, I'd also note that he's made a mountain of promises about new innovations that he hasn't kept or were eventually delayed. As more of these unmet promises pile up, my expectation is we'll see Tesla stock come under increased pressure.", "A citizen of the United Kingdom who was extradited to New York from Spain last month has pleaded guilty to cyberstalking and computer hacking schemes, including the 2020 hack of the social media site Twitter, the U.S. Justice Department said on Tuesday.\n\nJoseph James O'Connor, 23, was charged in both North Dakota and New York.\n\nThe North Dakota case was transferred to the U.S. District Court for the Southern District of New York.\n\nO'Connor pleaded guilty to charges including conspiring to commit computer intrusions, to commit wire fraud and to commit money laundering.\n\nO'Connor, who was extradited to the U.S. on April 26, will also forfeit more than $794,000 and pay restitution to victims, prosecutors said.\n\nHe faces a maximum of 77 years in prison at sentencing on June 23.\n\n\"O'Connor's criminal activities were flagrant and malicious, and his conduct impacted multiple people's lives. He harassed, threatened, and extorted his victims, causing substantial emotional harm,\" Assistant Attorney General Kenneth Polite said in a statement.\n\nProsecutors said the schemes included gaining unauthorized access to social media accounts on Twitter in July 2020 as well as a TikTok account in August 2020.\n\nAlong with his co-conspirators, O'Connor stole at least $794,000 worth of cryptocurrency.\n\nThe July 2020 Twitter attack hijacked a variety of verified accounts, including those of then-Democratic presidential candidate Joe Biden and Tesla Inc CEO Elon Musk, who now owns Twitter.\n\nThe accounts of former President Barack Obama, reality TV star Kim Kardashian, Bill Gates, Warren Buffett, Benjamin Netanyahu, Jeff Bezos, Michael Bloomberg and Kanye West were also hit.\n\nThe alleged hacker used the accounts to solicit digital currency, prompting Twitter to prevent some verified accounts from publishing messages for several hours until security could be restored."]}